tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFFSISteadyState/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho [1 -3 0 0 0 0 0] 2700;

nu              nu [0 0 0 0 0 0 0] 0.3;

E               E [1 -1 -2 0 0 0 0] 7e+10;

omega           omega [0 0 -1 0 0 0 0] (0 0 300);

planeStress     yes;

// ************************************************************************* //
