tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFFSISteadyState/0.sav/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       tetPointVectorField;
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletRotor
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }
    cyclic1
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    cyclic2
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    heat_transfer
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    shroud
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cyclicStator1
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    cyclicStator2
    {
        type            cyclicGgi;
        value           uniform (0 0 0);
    }
    outletRotor_ggi
    {
        type            ggi;
    }
    inletStator_ggi
    {
        type            ggi;
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
