tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFFSISteadyState/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

d2dt2Schemes
{
    default     Euler;
}

gradSchemes
{
    default         leastSquares;
//     grad(U)         Gauss linear;
//     grad(T)         Gauss linear;
}

divSchemes
{
    default         none;
    div(sigma)      Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(DU,U) Gauss linear corrected;
    laplacian(DT,T) Gauss linear corrected;
    laplacian(K,T)  Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    U;
    T;
}


// ************************************************************************* //
