tutorials/bladeMachines/DensityBasedTurbo/AxialMixerMRFFSISteadyState/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication -llog.blockMeshSolid blockMesh -region solid

runApplication setSet -batch setBatch
runApplication setsToZones -noFlipMap

runApplication -llog.setSetSolid setSet -batch setBatchSolid -region solid
runApplication -llog.setsToZonesSolid setsToZones -noFlipMap -region solid

cp -r constant/solid/boundary constant/solid/polyMesh
cp -r constant/boundary constant/polyMesh

cp -r ../Axial_Mixer_MRFCHT_SteadyState/10000 0
cp 0.sav/motionU 0/
cp 0.sav/solid/U 0/solid/

runApplication transonicMRFFSIDyMFoam
